int/resources/objectRepo/xmlTemplates/opera/HotelConfig/req_CreateSourceCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateSourceCodeRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:SourceCode Code="?" HotelCode="?" Inactive="?">
            <v91:Description>
               <v91:DefaultText/>
               <v91:TranslatedTexts>
                  <v91:Text Lang="?"/>
               </v91:TranslatedTexts>
            </v91:Description>
            <v91:Sequence/>
            <v91:GroupCode/>
         </v9:SourceCode>
      </v9:CreateSourceCodeRQ>
   </soapenv:Body>
</soapenv:Envelope>